## [debugtest](https://daniellem97.app.spacelift.io/stack/debugtest/run/01JD20WQ16EXN333BKSXNR0WKH) plan logs

<details>
<summary>Click here to expand</summary>

```
[01JD1TJS3MCTRXVR5XKD10KJB8] Planning changes with 0 custom hooks...
[01JD1TJS3MCTRXVR5XKD10KJB8] Running command: sh [-c spacelift-worker env >> /mnt/workspace/.env_hooks_before && terraform plan -input=false -lock=false -out=spacelift.plan && spacelift-worker env >> /mnt/workspace/.env_hooks_after]
data.terraform_remote_state.demo-stack-state: Reading...
data.terraform_remote_state.demo-stack-state: Read complete after 1s
aws_vpc.mtc_vpc9: Refreshing state... [id=vpc-075229ef6220b7194]
aws_vpc.mtc_vpc10: Refreshing state... [id=vpc-0633ceba640679f42]
aws_vpc.mtc_vpc4: Refreshing state... [id=vpc-0e69036197b298b17]
aws_vpc.mtc_vpc: Refreshing state... [id=vpc-0fa4697f94971fc28]
aws_vpc.mtc_vpc6: Refreshing state... [id=vpc-0dd41a082c8b356d8]
aws_vpc.mtc_vpc5: Refreshing state... [id=vpc-077970eba1b9bc2ae]
aws_vpc.mtc_vpc8: Refreshing state... [id=vpc-0607535f012b9f87c]
aws_vpc.mtc_vpc7: Refreshing state... [id=vpc-0c7072147a3059415]
aws_vpc.mtc_vpc1: Refreshing state... [id=vpc-080d98686629bb5b3]
aws_vpc.mtc_vpc2: Refreshing state... [id=vpc-071c5f180768bfcf6]
aws_vpc.mtc_vpc3: Refreshing state... [id=vpc-097845eb85aedf070]
data.aws_ami.server_ami: Reading...
aws_route_table.mtc_public_rt: Refreshing state... [id=rtb-00e807c3ddbda8a36]
aws_subnet.mtc_public_subnet: Refreshing state... [id=subnet-00e4b2acf727b6cb3]
aws_security_group.mtc_sg: Refreshing state... [id=sg-04239ca9c80d5e63b]
aws_internet_gateway.mtc_internet_gateway: Refreshing state... [id=igw-009541f2876b533fd]
aws_route_table_association.mtc_public_assoc: Refreshing state... [id=rtbassoc-00484e040c376be78]
aws_route.default_route2: Refreshing state... [id=r-rtb-00e807c3ddbda8a361080289494]
aws_route.default_route: Refreshing state... [id=r-rtb-00e807c3ddbda8a361080289494]
data.aws_ami.server_ami: Read complete after 1s [id=ami-09563a10670fc573c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_codebuild_project.example will be created
  + resource "aws_codebuild_project" "example" {
      + arn                  = (known after apply)
      + badge_enabled        = false
      + badge_url            = (known after apply)
      + build_timeout        = 10
      + description          = "Example AWS CodeBuild Project"
      + encryption_key       = (known after apply)
      + id                   = (known after apply)
      + name                 = "example-codebuild-project"
      + project_visibility   = "PRIVATE"
      + public_project_alias = (known after apply)
      + queued_timeout       = 480
      + service_role         = (known after apply)
      + tags_all             = (known after apply)

      + artifacts {
          + encryption_disabled    = false
          + location               = "codebuild-artifacts-bucket-unique-name"
          + override_artifact_name = false
          + packaging              = "ZIP"
          + path                   = "codebuild-output"
          + type                   = "S3"
        }

      + environment {
          + compute_type                = "BUILD_GENERAL1_SMALL"
          + image                       = "aws/codebuild/standard:6.0"
          + image_pull_credentials_type = "CODEBUILD"
          + privileged_mode             = false
          + type                        = "LINUX_CONTAINER"
        }

      + source {
          + buildspec = <<-EOT
                version: 0.2
                
                phases:
                  install:
                    runtime-versions:
                      nodejs: 16
                    commands:
                      - echo "Installing dependencies..."
                      - npm install
                  pre_build:
                    commands:
                      - echo "Running pre-build steps..."
                      - npm run lint
                  build:
                    commands:
                      - echo "Building the project..."
                      - npm run build
                  post_build:
                    commands:
                      - echo "Running post-build steps..."
                      - npm run test
                      - echo "Build complete!"
                
                artifacts:
                  files:
                    - "**/*"
                  discard-paths: yes
            EOT
          + type      = "NO_SOURCE"
        }
    }

  # aws_iam_role.codebuild_role will be created
  + resource "aws_iam_role" "codebuild_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codebuild-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.codebuild_policy will be created
  + resource "aws_iam_role_policy" "codebuild_policy" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + role   = "codebuild-role"
    }

  # aws_s3_bucket.codebuild_artifacts will be created
  + resource "aws_s3_bucket" "codebuild_artifacts" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "codebuild-artifacts-bucket-unique-name"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_vpc.mtc_vpc will be updated in-place
  ~ resource "aws_vpc" "mtc_vpc" {
        id                               = "vpc-0fa4697f94971fc28"
      ~ tags                             = {
            "Name" = "dev23"
          - "new"  = "new" -> null
        }
      ~ tags_all                         = {
          - "new"  = "new" -> null
            # (1 unchanged element hidden)
        }
        # (14 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

[01JD1TJS3MCTRXVR5XKD10KJB8] Changes are GO
[01JD1TJS3MCTRXVR5XKD10KJB8] Running command: sh [-c terraform show -json]
[01JD1TJS3MCTRXVR5XKD10KJB8] Uploading the list of managed resources...
[01JD1TJS3MCTRXVR5XKD10KJB8] Running command: sh [-c terraform show -json "spacelift.plan"]
[01JD1TJS3MCTRXVR5XKD10KJB8] Running command: sh [-c terraform output -json]
[01JD1TJS3MCTRXVR5XKD10KJB8] Please be aware that the run changes calculation includes output changes.
[01JD1TJS3MCTRXVR5XKD10KJB8] Resource list upload is GO
[01JD1TJS3MCTRXVR5XKD10KJB8] Generating JSON representation of the plan...
[01JD1TJS3MCTRXVR5XKD10KJB8] Running command: sh [-c terraform show -json "spacelift.plan"]
[01JD1TJS3MCTRXVR5XKD10KJB8] JSON representation is GO
[01JD1TJS3MCTRXVR5XKD10KJB8] Loading custom plan policy inputs...
[01JD1TJS3MCTRXVR5XKD10KJB8] 0 custom plan policy inputs found
[01JD1TJS3MCTRXVR5XKD10KJB8] Evaluated 1 plan policy
[01JD1TJS3MCTRXVR5XKD10KJB8] Plan policy warning: first warn
[01JD1TJS3MCTRXVR5XKD10KJB8] Plan policy warning: second warn
[01JD1TJS3MCTRXVR5XKD10KJB8] Plan checks are GO
```

</details>